#    הוספת הספרייה סוקט לתוכנית
from socket import socket, AF_INET, SOCK_DGRAM 
#    יצירת סוקט חדש לתוכנית 
#    הארגומנטים:
#    - AF_INET - אנחנו עובדים בכתובות של אייפי וי4
#    - SOCK_DGRAM - UDP פרוטוקול
s = socket(AF_INET, SOCK_DGRAM)
#    נאתחל את המשתנה להיות האייפי שלנו
#    אנחנו רוצים להקשיב לפניות שיפנו לאייפי של המחשב שלנו 
#    ולכן נשתמש בלופ-באק אייפי
source_ip = '127.0.0.1'
#    נאתחל את המשתנה להיות הפורט בו נרצה להאזין
source_port = 8080
#    נקשור את האובייקט של הסוקט שלנו לאייפי ולפורט שאנחנו רוצים
s.bind((source_ip, source_port))
#    פעל תמיד בלופ הבא:
while True:
    # קבל הודעה באורך 2048 בתים לכל היותר
    # הפונקציה של קבלת ההודעה מחזירה גם את הדאטה עצמו של ההודעה
    # וגם מידע לגבי השולח של הפקטה
    # הכוונה לאייפי ופורט של השולח
	data, sender_info = s.recvfrom(2048)
    # הדפס את המידע שקיבלת ואת המידע לגבי השולח
	print "Message: ", data, " from: ", sender_info
    # שלח בחזרה לשולח את המידע שקיבלת אך באותיות גדולות
	s.sendto(data.upper(), sender_info)